package com.tech51.quiz.persistance

import com.tech51.eduknowledge.data.vos.QAVo
import java.util.*
import kotlin.collections.ArrayList

object EduDataSource : IEduDataSource {
    override fun getAnswer(i: Int): String = questions.get(i).answer
    val choices = arrayListOf("မှန်", "မှာ:")
    val TRUE = "မှန်"
    val FALSE = "မှာ:"

    override fun shuffle() {
        Collections.shuffle(questions)
    }

    val questions: ArrayList<QAVo>

    init {
        val list = arrayListOf<QAVo>()
        list.add(
            QAVo(
                "ကလေးတစ်ဦး၏ ရုပ်ပိုင်းဆိုင်ရာ၊ စိတ်ပိုင်းဆိုင်ရာ၊ ပေါင်းသင်းဆက်ဆံရေးဆိုင်ရာ၊ သင်ယူမှုဆိုင်ရာ ဖွံ့ဖြိုးတိုးတက်မှု နယ်ပယ်များသည် တစ်ခုနှင့်တစ်ခု ချိတ်ဆက်လွှမ်းမိုးမှုရှိသည်။"
                , TRUE,
                choices

            )
        )
        list.add(
            QAVo(
                "ကလေး၏ ငယ်စဥ်ဘဝ ရုပ်ပိုင်းဆိုင်ရာ၊ စိတ်ပိုင်းဆိုင်ရာ ဖွံ့ဖြိုးတိုးတက်မှုများသည် ၎င်းကလေးအသက်အရွယ်ကြီးလာသည်အထိ လွှမ်းမိုးမှုမရှိပါ။",
                FALSE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေး၏ ပေါင်းသင်းဆက်ဆံရေးဆိုင်ရာဖွံ့ဖြိုးတိုးတက်မှုသည် ၎င်းထိတွေ့ဆက်ဆံရသောပတ်ဝန်းကျင် (ဥပမာ-မိဘ၊ ဆွေမျိုး) တို့၏ ပြုစုပျိုးထောင်မှုပေါ်မူတည်၍ကွဲပြားသွားနိုင်သည်။",
                TRUE
                ,
                choices
            )
        )
        list.add(
            QAVo(
                "ကစားခြင်းသည် ကလေး၏ဘက်စုံဖွံ့ဖြိုးတိုးတက်မှုအတွက်အလွန်အရေးကြီးသည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "ဦးနှောက်ဖွံ့ဖြိုးတိုးတက်မှုနွေးကွေးခြင်းသည် အစာအာဟာရမပြည့်ဝခြင်းနှင့်ဆက်စပ်မှုမရှိပါ။",
                FALSE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးသည်အသက်အရွယ်အစောပိုင်း ကာလတွင် ဦးနှောက်ဖွံ့ဖြိုးမှု နှေးကွေးသည်။",
                FALSE,
                choices
            )
        )
        list.add(
                QAVo(
                    "ကလေးများသည် အတုယူခြင်းနည်းဖြင့် သင်ယူမှုပြုလုပ်ကြသည်။",
                    TRUE,
                    choices
                )
                )
        list.add(
            QAVo(
                "ကလေးများသည် ၎င်းတို့ပတ်ဝန်းကျင်ရှိ သက်ရှိ၊ သက်မဲ့ အရာများနှင့် စူးစမ်းလေ့လာထိတွေ့ဆက်ဆံခြင်းဖြင့် သင်ယူမှုပြုလုပ်ကြသည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးများနှင့် မိဘ၊ ဆွေမျိုး၊ သူငယ်ချင်း၊လူမှုဝန်းကျင်အဖွဲ့အစည်းတို့၏ချစ်ခင်ကြင်နာနွေးထွေးသောဆက်ဆံရေးသည် ၎င်းတို့၏ဖွံ့ဖြိုးတိုးတက်မှုအပေါ်တွင် သက်ရောက်မှုရှိသည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးများ၏ ရုပ်ပိုင်းဆိုင်ရာ၊ စိတ်ပိုင်းဆိုင်ရာ ဖွံ့ဖြိုးတိုးတက်မှုများသည် ကလေး၏မျိုးရိုးဗီဇနှင့်သာ သက်ဆိုင်သည်။ပြုစုပျိုးထောင်မှု ပုံစံနှင့်မသက်ဆိုင်ပါ။",
                FALSE,
                choices
            )
        )
        list.add(
            QAVo(
                "အစားအသောက်များအား ကလေးကိုယ်တိုင် စိတ်ကြိုက်ရွေးချယ်စားသောက်ခွင့်ကိုပေးသင့်သည်။",
                FALSE,

                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးအား သူအိပ်ချင်သည်ဆိုသောအချိန်မှသာ အိပ်ခိုင်းသင့်သည်။",
                FALSE,
                choices
            )
        )
        list.add(
            QAVo(
                "အသက်(၂)နှစ်မှ (၇)နှစ်အတွင်း ကလေးတစ်ဦးသည် တစ်ညလျှင် ပျမ်းမျှ အိပ်ချိန် ၁၁နာရီ လိုအပ်သည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးများ၏ကျန်းမာရေးအတွက် ဆရာဝန်ထံတွင် ပုံမှန်စစ်ဆေးမှု ပြုလုပ်ပေးသင့်သည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးတွင် ရောဂါလက္ခဏာ တစ်စုံတစ်ရာ တွေ့ရှိပါက နီးစပ်ရာဆေးဆိုင်မှ သင့်တော်သော ဆေးဝယ်ပေးသင့်သည်။",
                FALSE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကာကွယ်ဆေးထိုးခြင်းသည် ကလေးများ ၏ကျန်းမာရေးအတွက် ရေရှည်တွင် အကျိုးသက်ရောက်မှု မရှိပါ။",
                FALSE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးများ၏ပတ်ဝန်းကျင်အနီးတွင် ဆေးလိပ်သောက်ခြင်းသည် ကလေးများ၏ကျန်းမာရေးကို အလွန်ထိခိုက်စေသည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "ထိခိုက်အန္တရာယ်ဖြစ်စေမည့် ပစ္စည်းများ(ဥပမာ- ဓား၊ ကတ်ကြေး၊ ဆေးဝါး) ကို ကလေးများ လက်လှမ်းမမီသောနေရာတွင် သိမ်းဆည်းထားသင့်သည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "လျှပ်စစ်မီးပလက်များ၊ မီးခလုတ်များ၊ ဖယောင်းတိုင်မီးများအားဆော့ကစားခြင်း မပြုရန် ကလေးများအား ကြိုတင်သင်ကြားပေးထားသင့်သည်။ ",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "မိဘများအနေဖြင့် ကလေးသူငယ်အကြမ်းဖက်မှု နှင့်ပတ်သက်သောစာစောင်များကို ဖတ်ရှုလေ့လာထားရန်လိုအပ်သည်။ ",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးနှင့် အတူဆော့ကစားရန်၊ ကိုယ်ကာယလေ့ကျင့်ခန်းပြုလုပ်ရန် အချိန်တစ်ခုသတ်မှတ်ထားသင့်သည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "မိဘများ အိမ်ထောင်ကွဲခြင်းသည် သားသမီးများအား ရုပ်ပိုင်းဆိုင်ရာ ၊ စိတ်ပိုင်းဆိုင်ရာ ထိခိုက်မှုကို ဖြစ်စေသည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "မိမိ၏သားသမီးများတွင် ကလေးအငယ်အား ဦးစားပေးဆက်ဆံသင့်သည်။",
                FALSE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးသည် အလုပ်တစ်ခုကိုအောင်မြင်အောင် လုပ်နိုင်မှသာ ၎င်းကို ချီးကျူးစကားပြောသင့်သည်။",
                FALSE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးအား အခြားကလေးတစ်ဦးနှင့် နှိုင်းယှဥ်ဝေဖန်သင့်သည်။",
                FALSE,
                choices
            )
        )
        list.add(
            QAVo(
                "ကလေးအား နှုတ်ဖြင့်ပြောဆိုဆုံးမ၍ မရပါက ရိုက်နှက်ဆုံးမသင့်သည်။",
                FALSE,
                choices
            )
        )
        list.add(
            QAVo(
                "သူတပါးအား ကူညီတတ်စေရန်၊ ကြင်နာတတ်စေရန် မိဘကိုယ်တိုင်က စံနမူနာပြနေထိုင်ပြခြင်းသည် အကောင်းဆုံးနည်းလမ်းဖြစ်သည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "အများနှင့် ပူးပေါင်းဆောင်ရွက်တတ်သော အလေ့အကျင့်ကောင်းများ ရရှိစေရန် ကလေးအား အဖွဲ့လိုက်ကစားရသော ကစားနည်းများတွင် ပါဝင်ခွင့်ပေးသင့်သည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "အဖြေအမျိုးမျိုးဖြေဆိုနိုင်သော မေးခွန်းများကို မေးမြန်းခြင်းဖြင့် ကလေး၏အတွေးအခေါ် နှင့် စိတ်ကူးစိတ်သန်းကို ရင့်သန်စေသည်။",
                TRUE,
                choices
            )
        )
        list.add(
            QAVo(
                "မိဘများသည် ကလေးများကိုယ်တိုင် ပတ်ဝန်းကျင်ကို စူးစမ်းလေ့လာ ရှာဖွေတတ်သော အလေ့အကျင့်ကို တွန်းအားပေးသင့်သည်။",
                TRUE,
                choices
            )
        )














        questions = list

    }

    override fun getQuestions(i: Int): QAVo = questions.get(i)
}